zhanzr/cy8ckit-demo/app/mtb_shared/mtb-pdl-cat1/release-v3.23.0/drivers/source/cy_smif.c
#if (CY_IP_MXSMIF_VERSION >= 4) || defined (CY_DOXYGEN)
/*******************************************************************************
* Function Name: Cy_SMIF_DllConfig
****************************************************************************//**
*
* This function configures the DLL for use, per the SMIF configuration structure
* parameters.
*
* \param base
* Holds the base address of the SMIF block registers.
*
* \param config
* Passes a configuration structure that configures the SMIF block for operation,
* here specifically it is used to configure the DLL.
*
* \param context
* Passes a configuration structure that contains the transfer parameters of the
* SMIF block.
*
* \return
*     - \ref CY_SMIF_BAD_PARAM
*     - \ref CY_SMIF_SUCCESS

* \note The SMIF must be disabled before calling the function. Call
*  \ref Cy_SMIF_Disable
*
*******************************************************************************/
cy_en_smif_status_t Cy_SMIF_DllConfig(volatile SMIF_Type *base,
                                    cy_stc_smif_config_t const *config,
                                    cy_stc_smif_context_t *context)
{
    if ((NULL == base) || (NULL == config) || (NULL == context))
    {
        return CY_SMIF_BAD_PARAM;
    }

    /* Bounds check the tap selection.  See MDL_TAP_SEL restrictions in TRM. */
    if (config->dll_divider_value != CY_SMIF_DLL_DIVIDE_BY_2)
    {
        if ((config->mode == (uint32_t)CY_SMIF_NORMAL) && (context->preCmdDataRate == CY_SMIF_SDR)) 
        {
            /* Bounds for when SDR is in use. */
            if ((config->mdl_tap < CY_SMIF_CLKOUT_NON_ZERO_MDL_TAP_MIN_SDR) || (config->mdl_tap > CY_SMIF_CLKOUT_NON_ZERO_MDL_TAP_MAX_SDR))
            {
                return CY_SMIF_BAD_PARAM;
            }
        }
        else 
        {
            /* Bounds for when DDR is in use. */
            if ((config->mdl_tap < CY_SMIF_CLKOUT_NON_ZERO_MDL_TAP_MIN_DDR) || (config->mdl_tap > CY_SMIF_CLKOUT_NON_ZERO_MDL_TAP_MAX_DDR)) 
            {
                return CY_SMIF_BAD_PARAM;
            }
        } 
    }
        
    /* Make sure we start from a sane default. */
    uint32_t tmp_ctl2 = CY_SMIF_CTL2_REG_DEFAULT;

    /* Enable the DLL, if needed.   Otherwise, enable the bypass. */
    if (config->enable_internal_dll)
    {
        /* These values are taken from the Register TRM entry for SMIF_CORE_CTL2_DLL_SPEED_MODE. */
        #if (CY_IP_MXSMIF_VERSION == 4)
        const uint32_t pll_freq_bounds[] = {160u, 180u, 266u, 333u, 400u};
        #elif (CY_IP_MXSMIF_VERSION >= 5)
        const uint32_t pll_freq_bounds[] = {150u, 192u, 245u, 313u, 400u};
        const uint32_t dll_skip_lsb_vals[] = {0U, 0U, 1U, 3U};
        #endif


#if (CY_IP_MXSMIF_VERSION == 4)
        if (config->inputFrequencyMHz <= 160U) {
            /* Minimum input frequency for SMIFv4 is 160 MHz. */
            CY_ASSERT(false);
            return CY_SMIF_BAD_PARAM;
        }
#else
        if (config->inputFrequencyMHz <= 150U)
        {
            /* DLL must run in open loop mode when input frequency is lower
             than 150 MHz for SMIFv5 or greater. */
            SMIF_CTL2(base) |= _VAL2FLD(SMIF_CORE_CTL2_DLL_OPENLOOP_ENABLE, 1U);
            SMIF_IDAC(base) = 0; /* Set to 0 for max delay (for accuracy), minimum delay value is 0xA7F. */
        }
#endif
        else
        {
            /* Determine the frequency bounds and set the speed mode accordingly */
            uint32_t pll_bounds_idx;
            uint32_t pll_bounds_cnt = (sizeof(pll_freq_bounds) / sizeof(pll_freq_bounds[0])) - 1UL;
            for (pll_bounds_idx = 0UL; pll_bounds_idx < pll_bounds_cnt; pll_bounds_idx++)
            {
                if ((pll_freq_bounds[pll_bounds_idx] <= config->inputFrequencyMHz) && 
                    (config->inputFrequencyMHz <= pll_freq_bounds[pll_bounds_idx + 1UL]))
                {
                    tmp_ctl2 |= _VAL2FLD(SMIF_CORE_CTL2_DLL_SPEED_MODE, pll_bounds_idx);
#if (CY_IP_MXSMIF_VERSION >= 5UL)
                    tmp_ctl2 |= (_VAL2FLD(SMIF_CORE_CTL2_DLL_SKIP_LSB, dll_skip_lsb_vals[pll_bounds_idx]) |
                            SMIF_CORE_CTL2_DLL_IGNORE_LOCK_Msk |             //Recommendation from IP team
                            _VAL2FLD(SMIF_CORE_CTL2_DLL_UNLOCK_VALUE, 5U));  //Recommendation from IP team
#endif
                    break;
                }
            }
            if (pll_bounds_idx == pll_bounds_cnt)
            {
                return CY_SMIF_BAD_PARAM;
            }
        }
    }
#if (CY_IP_MXSMIF_VERSION >= 5)
    else
    {
        /* DLL runs in open loop mode */
        tmp_ctl2 |= SMIF_CORE_CTL2_DLL_BYPASS_MODE_Msk;
        tmp_ctl2 |= _VAL2FLD(SMIF_CORE_CTL2_DLL_OPENLOOP_ENABLE, 1U);
        SMIF_IDAC(base) = 0U; /* Set max delay for accuracy */
    }
#endif

    tmp_ctl2 |= _VAL2FLD(SMIF_CORE_CTL2_CLKOUT_DIV, config->dll_divider_value);
    tmp_ctl2 |= _VAL2FLD(SMIF_CORE_CTL2_MDL_TAP_SEL, config->mdl_tap);
    tmp_ctl2 |= _VAL2FLD(SMIF_CORE_CTL2_RX_CAPTURE_MODE, config->rx_capture_mode);
    tmp_ctl2 |= _VAL2FLD(SMIF_CORE_CTL2_RX_CHASE_MARGIN, 2UL); /* The default value expected to always work */
    tmp_ctl2 |= _VAL2FLD(SMIF_CORE_CTL2_TX_SDR_EXTRA_SETUP, config->tx_sdr_extra);

    /* Write the register value that has been constructed per the configuration input. */
    SMIF_CTL2(base) = tmp_ctl2;

    return CY_SMIF_SUCCESS;
}
#endif  /* (CY_IP_MXSMIF_VERSION >= 4) */


/*******************************************************************************
* Function Name: Cy_SMIF_DeInit
****************************************************************************//**
*
* This function de-initializes the SMIF block to default values.
*
* \param base
* Holds the base address of the SMIF block registers.
*
* \note The SMIF must be disabled before calling the function. Call
*  \ref Cy_SMIF_Disable
*
*******************************************************************************/
void Cy_SMIF_DeInit(SMIF_Type *base)
{
    uint32_t idx;

    /* Configure the SMIF interface to default values.
    * The default value is 0.
    */
    SMIF_CTL(base) = CY_SMIF_CTL_REG_DEFAULT;
#if (CY_IP_MXSMIF_VERSION >= 4)
    SMIF_CTL2(base) = CY_SMIF_CTL2_REG_DEFAULT;
#endif
    SMIF_TX_DATA_FIFO_CTL(base) = 0U;
    SMIF_RX_DATA_FIFO_CTL(base) = 0U;
    SMIF_INTR_MASK(base) = 0U;

