zhanzr/cy8ckit-demo/app/mtb_shared/mtb-pdl-cat1/release-v3.23.0/drivers/source/cy_smif.c
    SMIF_DEVICE_RX_CAPTURE_CONFIG(smif_device_base) = _CLR_SET_FLD32U(SMIF_DEVICE_RX_CAPTURE_CONFIG(smif_device_base), SMIF_CORE_DEVICE_RX_CAPTURE_CONFIG_POS_SDL_TAP_SEL, tapSel);
    SMIF_DEVICE_RX_CAPTURE_CONFIG(smif_device_base) = _CLR_SET_FLD32U(SMIF_DEVICE_RX_CAPTURE_CONFIG(smif_device_base), SMIF_CORE_DEVICE_RX_CAPTURE_CONFIG_NEG_SDL_TAP_SEL, tapSel);

    return CY_SMIF_SUCCESS;
}

/*******************************************************************************
* Function Name: CY_SMIF_GetDelayTapsNumber
****************************************************************************//**
*
* This function returns tap number which the SMIF IP has. 
* User can input both SMIF DEVICE block address and SMIF block address
*
* \param base
* Base address of the SMIF block or the SMIF DEVICE block.
*
* \return Delay tap Number of the SMIF IP
*
*******************************************************************************/
uint32_t CY_SMIF_GetDelayTapsNumber(volatile void *base)
{
#if defined (CY_IP_MXSMIF_VERSION) && (CY_IP_MXSMIF_VERSION >= 4)
    CY_UNUSED_PARAMETER(base);
    return SMIF_DELAY_TAPS_NR;
#else
#if defined (SMIF_DELAY_TAPS_NR)
    if((base == CY_SMIF_DRV_SMIF0_CORE0) || (base == CY_SMIF_DRV_SMIF0_CORE0_DEVICE0) || (base == CY_SMIF_DRV_SMIF0_CORE0_DEVICE1))
    {
        return CY_SMIF_DRV_SMIF0_DELAY_TAPS_NR;
    }
    else if((base == CY_SMIF_DRV_SMIF0_CORE1) || (base == CY_SMIF_DRV_SMIF0_CORE1_DEVICE0) || (base == CY_SMIF_DRV_SMIF0_CORE1_DEVICE1))
    {
        return CY_SMIF_DRV_SMIF1_DELAY_TAPS_NR;
    }
    else
    {
        /* Nothing to be done. */
    }
#endif

#if defined (CY_SMIF_DLL_TAP_MAX)
    if((base == CY_SMIF_DRV_SMIF0_CORE0) || (base == CY_SMIF_DRV_SMIF0_CORE0_DEVICE0) || (base == CY_SMIF_DRV_SMIF0_CORE0_DEVICE1)
        || (base == CY_SMIF_DRV_SMIF0_CORE1) || (base == CY_SMIF_DRV_SMIF0_CORE1_DEVICE0) || (base == CY_SMIF_DRV_SMIF0_CORE1_DEVICE1))
    {
        return CY_SMIF_DLL_TAP_MAX;
    }
#endif

    // Reaching here may mean that DLP calibration is available. Please use that.
    // Or means input bad parameter
    CY_ASSERT_L2(false);
#ifdef NDEBUG // CY_ASSERT will be removed, therefore a "return" is needed which would could otherwise cause a "statement unreachable" warning
    return 0;
#endif
#endif /* CY_IP_MXSIF_VERSION == 4 */
}

#endif /* MXSMIF_VERSION >= 4 */

/*******************************************************************************
* Function Name: Cy_SMIF_TransmitCommand()
****************************************************************************//**
*
* This function transmits a command byte followed by a parameter which is
* typically an address field. The transfer is implemented using the TX FIFO.
* This function also asserts the slave select line.
* A command to a memory device generally starts with a command byte
* transmission. This function sets up the slave lines for the rest of the
* command structure. The \ref Cy_SMIF_TransmitCommand is called before \ref
* Cy_SMIF_TransmitData or \ref Cy_SMIF_ReceiveData is called. When enabled, the
* completeTxfr parameter in the function will de-assert the slave select line at
* the end of the function execution.
*
* \note This function blocks until all the command and associated parameters
* have been transmitted over the SMIF block or timeout expire.
*
* \param base
* Holds the base address of the SMIF block registers.
*
* \param cmd
* The command byte to be transmitted.
*
* \param cmdTxfrWidth
* The width of command byte transfer \ref cy_en_smif_txfr_width_t.
*
* \param cmdParam
* This is the pointer to an array that has bytes to be transmitted
* after the command byte. Typically, this field has the address bytes
* associated with the memory command.
*
* \param paramSize
* The size of the cmdParam array.
*
* \param paramTxfrWidth
* The width of parameter transfer \ref cy_en_smif_txfr_width_t.
*
* \param slaveSelect
* Denotes the number of the slave device to which the transfer is made.
* (0, 1, 2 or 4 - the bit defines which slave to enable) Two-bit enable is
* possible only for the double quad SPI mode.
*
* \param completeTxfr
* Specifies if the slave select line must be de-asserted after transferring
* the last byte in the parameter array. Typically, this field is set to 0 when
* this function succeed through \ref Cy_SMIF_TransmitData or \ref
* Cy_SMIF_ReceiveData.
*
* \param context
* Passes a configuration structure that contains the transfer parameters of the
* SMIF block.
*
* \return A status of the command transmit.
*       - \ref CY_SMIF_SUCCESS
*       - \ref CY_SMIF_EXCEED_TIMEOUT
*
* \note Check \ref group_smif_usage_rules for any usage restriction
*
*******************************************************************************/
cy_en_smif_status_t  Cy_SMIF_TransmitCommand(SMIF_Type *base,
                                uint8_t cmd,
                                cy_en_smif_txfr_width_t cmdTxfrWidth,
                                uint8_t const cmdParam[],
                                uint32_t paramSize,
                                cy_en_smif_txfr_width_t paramTxfrWidth,
                                cy_en_smif_slave_select_t  slaveSelect,
                                uint32_t completeTxfr,
                                cy_stc_smif_context_t const *context)
{
#if (CY_IP_MXSMIF_VERSION>=2)
   return Cy_SMIF_TransmitCommand_Ext(base,
                                      (uint16_t)cmd,
                                      false,
                                      cmdTxfrWidth,
                                      CY_SMIF_SDR,
                                      cmdParam,
                                      paramSize,
                                      paramTxfrWidth,
                                      CY_SMIF_SDR,
                                      slaveSelect,
                                      completeTxfr,
                                      context);
#else
        /* The return variable */
        cy_en_smif_status_t result = CY_SMIF_SUCCESS;

