zhanzr/cy8ckit-demo/app/mtb_shared/mtb-pdl-cat1/release-v3.23.0/drivers/source/cy_smif.c
#if (CY_IP_MXSMIF_VERSION == 6U)
    if (crypto_region_index >= SMIF0_CRYPTO_KEY_NR)
    {
        return CY_SMIF_BAD_PARAM;
    }
#else
    if (crypto_region_index >= SMIF_CRYPTO_KEY_NR)
    {
        return CY_SMIF_BAD_PARAM;
    }
#endif


    SMIF_CRYPTO_IDX_INPUT0(base, crypto_region_index) = region_config->iv[0];
    SMIF_CRYPTO_IDX_INPUT1(base, crypto_region_index) = region_config->iv[1];
    SMIF_CRYPTO_IDX_INPUT2(base, crypto_region_index) = region_config->iv[2];
    SMIF_CRYPTO_IDX_INPUT3(base, crypto_region_index) = region_config->iv[3];

    SMIF_CRYPTO_IDX_KEY0(base, crypto_region_index) = region_config->key[0];
    SMIF_CRYPTO_IDX_KEY1(base, crypto_region_index) = region_config->key[1];
    SMIF_CRYPTO_IDX_KEY2(base, crypto_region_index) = region_config->key[2];
    SMIF_CRYPTO_IDX_KEY3(base, crypto_region_index) = region_config->key[3];

    SMIF_CRYPTO_IDX_ADDR(base, crypto_region_index) = (uint32_t)region_config->region_base_address;
    SMIF_CRYPTO_IDX_MASK(base, crypto_region_index) = region_config->region_size;

    return CY_SMIF_SUCCESS;
}

/*******************************************************************************
* Function Name: Cy_SMIF_SetCryptoSubRegionDisable
****************************************************************************//**
*
* Disable sub regions within crypto region. Each crypto region is further divided
* into 8 equal sub regions and user can disable on the fly encryption/decryption by
* setting "1" for that specific region using mask. For example, if a 1 MB region is
* specified for a crypto region then the 8 subregions will be 128 KB.
* If mask is set with "0" then cryptography will be performed on that subregion
*
* \param base
* Holds the base address of the SMIF block registers.
*
* \param crypto_region_index
* Crypto region index for which sub region disable mask has to be applied.
*
* \param mask
* 8-bit mask to disable individual sub-region within a crypto region
*
* \return \ref cy_en_smif_status_t.
*
*******************************************************************************/

cy_en_smif_status_t Cy_SMIF_SetCryptoSubRegionDisable(SMIF_Type *base,
                                                      uint8_t crypto_region_index,        /* Indexes can be upto 8 based on target platform */
                                                      uint8_t mask)
{
    if (base == NULL)
    {
        return CY_SMIF_BAD_PARAM;
    }

#if (CY_IP_MXSMIF_VERSION == 6U)
    if (crypto_region_index >= SMIF0_CRYPTO_KEY_NR)
    {
        return CY_SMIF_BAD_PARAM;
    }
#else
    if (crypto_region_index >= SMIF_CRYPTO_KEY_NR)
    {
        return CY_SMIF_BAD_PARAM;
    }
#endif

    SMIF_CRYPTO_IDX_SUBREGION(base, crypto_region_index) = mask;

    return CY_SMIF_SUCCESS;
}
#endif  // (CY_IP_MXSMIF_VERSION>=3) || defined (CY_DOXYGEN)
/*******************************************************************************
* Function Name: Cy_SMIF_Encrypt()
****************************************************************************//**
*
* Uses the Encryption engine to create an encrypted result when the input, key
* and data arrays are provided. The AES-128 encryption of the address with the
* key, fetching the result and XOR with the data array are all done in the
* function. The operational scheme is the following:
*                   data = XOR(AES128(address, key), data)
* Decryption is done using the input data-array identically to the encryption.
* In the XIP mode, encryption and decryption are done without calling this
* function. The operational scheme in the XIP mode is the same. The address
* parameter in the XIP mode equals the actual address in the PSoC memory map.
* The SMIF encryption engine is designed for code storage.
* For data storage, the encryption key can be changed.
* For sensitive data, the Crypto block is used.
*
* \note The API does not have access to the encryption key. The key must be
* placed in the register using \ref Cy_SMIF_SetCryptoKey() before calling this API.
* The crypto routine that can access the key storage area is recommended.
* This crypto routine is typically a protection context 0 function.
*
* \note This is a blocking API. The API waits for encryption completion. Will
* exit if a timeout is set (not equal to 0) and expired.
*
* \param base
* Holds the base address of the SMIF block registers.
*
* \param address
* The address that gets encrypted is a masked 16-byte block address. The 32-bit
* address with the last 4 bits masked is placed as the last 4 bytes in the
* 128-bit input. The rest of the higher bit for the 128 bits are padded zeros by default.
* PA[127:0]:
* PA[3:0] = 0
* PA[7:4] = ADDR[7:4].
* PA[15:8] = ADDR[15:8].
* PA[23:16] = ADDR[23:16].
* PA[31:24] = ADDR[31:24].
* The other twelve of the sixteen plain text address bytes of PA[127:0] are "0" by default.
* User can initialize PA[127:32] with \ref Cy_SMIF_SetCryptoIV().
*
* \param data
* This is the location where the input data-array is passed while the function
* is called. This array gets populated with the result after encryption is
* completed.
*
* \param size
* Provides a size of the array.
*
* \param context
* Passes a configuration structure that contains the transfer parameters of the
* SMIF block.
*
* \return A status of the command transmit.
*       - \ref CY_SMIF_SUCCESS
*       - \ref CY_SMIF_EXCEED_TIMEOUT
*       - \ref CY_SMIF_BAD_PARAM
*
* \funcusage
* \snippet smif/snippet/main.c snippet_Cy_SMIF_Encrypt
*
*******************************************************************************/
cy_en_smif_status_t  Cy_SMIF_Encrypt(SMIF_Type *base,
                                        uint32_t address,
                                        uint8_t data[],
                                        uint32_t size,
                                        cy_stc_smif_context_t const *context)
{
    uint32_t bufIndex;
    cy_en_smif_status_t status = CY_SMIF_BAD_PARAM;
    uint32_t timeoutUnits = context->timeout;

    CY_ASSERT_L2(size > 0U);

    if((NULL != data) && ((address & (~CY_SMIF_CRYPTO_ADDR_MASK)) == 0UL) )
    {
        status = CY_SMIF_SUCCESS;
        /* Fill the output array */
        for(bufIndex = 0U; bufIndex < (size / CY_SMIF_AES128_BYTES); bufIndex++)
        {
            uint32_t dataIndex = bufIndex * CY_SMIF_AES128_BYTES;
            uint8_t  cryptoOut[CY_SMIF_AES128_BYTES];
            uint32_t  outIndex;

            /* Fill the input field */
            SMIF_CRYPTO_INPUT0(base) = (uint32_t) (address +
                ((bufIndex * CY_SMIF_AES128_BYTES) & CY_SMIF_CRYPTO_ADDR_MASK));

