zhanzr/cy8ckit-demo/app/mtb_shared/mtb-pdl-cat1/release-v3.23.0/drivers/source/cy_smif.c
    if ((size == 0U) || (size > 16U))
    {
        status = CY_SMIF_BAD_PARAM;
    }

    if ( status == CY_SMIF_SUCCESS)
    {
        /* Clear values before writing user provided inputs */
        SMIF_DLP_CTL(base) = (_VAL2FLD(SMIF_CORE_DLP_CTL_DLP, 0) |
                             _VAL2FLD(SMIF_CORE_DLP_CTL_DLP_SIZE, 0));

        /* Configure user inputs */
        SMIF_DLP_CTL(base) = (_VAL2FLD(SMIF_CORE_DLP_CTL_DLP, dlp) |
                             _VAL2FLD(SMIF_CORE_DLP_CTL_DLP_SIZE, (uint32_t)size - 1UL));
    }
    return status;
}
/*******************************************************************************
* Function Name: Cy_SMIF_GetMasterDLP
****************************************************************************//**
* This function gets the data learning pattern configured.
*
* \param base
* Holds the base address of the SMIF block registers.
*
* \return Data learning pattern configured
*
*
* \snippet smif/snippet/main.c snippet_SMIF_DLP
*
* \note
* This API is available for CAT1D and CAT1C (TVIIC only) devices.
*******************************************************************************/
uint16_t Cy_SMIF_GetMasterDLP(SMIF_Type *base)
{
    return (uint16_t)_FLD2VAL(SMIF_CORE_DLP_CTL_DLP, SMIF_DLP_CTL(base));
}
/*******************************************************************************
* Function Name: Cy_SMIF_GetMasterDLPSize
****************************************************************************//**
* This function gets the data learning pattern size configured.
*
* \param base
* Holds the base address of the SMIF block registers.
*
* \return Data learning pattern size configured.
*
* \snippet smif/snippet/main.c snippet_SMIF_DLP
*
* \note
* This API is available for CAT1D and CAT1C (TVIIC only) devices.
*******************************************************************************/
uint8_t Cy_SMIF_GetMasterDLPSize(SMIF_Type *base)
{
    return (uint8_t)(_FLD2VAL(SMIF_CORE_DLP_CTL_DLP_SIZE, SMIF_DLP_CTL(base)) + 1U);
}
/*******************************************************************************
* Function Name: Cy_SMIF_GetTapNumCapturedCorrectDLP
****************************************************************************//**
* This function gets number of delay taps used for specified data line.
*
* \param base
* Holds the base address of the SMIF block registers.
*
* \param bit
* DLP Tap selection for the bit position mapped as per \ref Cy_SMIF_SetDataSelect.
*
* \return Data learning pattern configured
*
* \snippet smif/snippet/main.c snippet_Cy_SMIF_GetTapNumCapturedCorrectDLP
*
* \note
* This API is available for CAT1D and CAT1C (TVIIC only) devices.
*******************************************************************************/
uint8_t Cy_SMIF_GetTapNumCapturedCorrectDLP(SMIF_Type *base, uint8_t bit)
{
    uint32_t delay_tap = 0;

    switch(bit)
    {
        case 0:
        {
           delay_tap = _FLD2VAL(SMIF_CORE_DLP_DELAY_TAP_SEL0_DATA_BIT0_TAP_SEL, SMIF_DLP_DELAY_TAP_SEL0(base));
        }
        break;
        case 1:
        {
           delay_tap = _FLD2VAL(SMIF_CORE_DLP_DELAY_TAP_SEL0_DATA_BIT1_TAP_SEL, SMIF_DLP_DELAY_TAP_SEL0(base));
        }
        break;
        case 2:
        {
           delay_tap = _FLD2VAL(SMIF_CORE_DLP_DELAY_TAP_SEL0_DATA_BIT2_TAP_SEL, SMIF_DLP_DELAY_TAP_SEL0(base));
        }
        break;
        case 3:
        {
           delay_tap = _FLD2VAL(SMIF_CORE_DLP_DELAY_TAP_SEL0_DATA_BIT3_TAP_SEL, SMIF_DLP_DELAY_TAP_SEL0(base));
        }
        break;
        case 4:
        {
           delay_tap = _FLD2VAL(SMIF_CORE_DLP_DELAY_TAP_SEL1_DATA_BIT4_TAP_SEL, SMIF_DLP_DELAY_TAP_SEL1(base));
        }
        break;
        case 5:
        {
           delay_tap = _FLD2VAL(SMIF_CORE_DLP_DELAY_TAP_SEL1_DATA_BIT5_TAP_SEL, SMIF_DLP_DELAY_TAP_SEL1(base));
        }
        break;
        case 6:
        {
           delay_tap = _FLD2VAL(SMIF_CORE_DLP_DELAY_TAP_SEL1_DATA_BIT6_TAP_SEL, SMIF_DLP_DELAY_TAP_SEL1(base));
        }
        break;
        case 7:
        {
           delay_tap = _FLD2VAL(SMIF_CORE_DLP_DELAY_TAP_SEL1_DATA_BIT7_TAP_SEL, SMIF_DLP_DELAY_TAP_SEL1(base));
        }
        break;
        default:
             delay_tap = 0;
             break;
    }
    return  (uint8_t)delay_tap;
}
#endif  /* (CY_IP_MXSMIF_VERSION>=4) &&
     ((defined (SMIF_DLP_PRESENT) && (SMIF_DLP_PRESENT > 0)) ||
      (defined (SMIF0_DLP_PRESENT) && (SMIF0_DLP_PRESENT > 0)) ||
      (defined (SMIF1_DLP_PRESENT) && (SMIF1_DLP_PRESENT > 0))) || defined (CY_DOXYGEN)) */

#if (CY_IP_MXSMIF_VERSION>=2) || defined (CY_DOXYGEN)
/*******************************************************************************
* Function Name: Cy_SMIF_DeviceTransfer_SetMergeTimeout
****************************************************************************//**
*
* This function enables merging continuous transfers over XIP so that the overhead
* of transferring command and address will not be there for reading consecutive addresses.
* User can specify a timeout value to specify how long the device would be selected waiting
* for next incremental address read.
*
* \param base
* Holds the base address of the SMIF block registers.
*
* \param slave
* Holds the slave select line for which merge should be enabled.
*
* \param timeout (see \ref cy_en_smif_merge_timeout_t)
*
* \note This API is not supported on CAT1A devices.
* \note External memory should also support this mode of transfer.
*
* \snippet smif/snippet/main.c snippet_Cy_SMIF_MergeTimeout
*******************************************************************************/
void Cy_SMIF_DeviceTransfer_SetMergeTimeout(SMIF_Type *base, cy_en_smif_slave_select_t slave, cy_en_smif_merge_timeout_t timeout)
{
    SMIF_DEVICE_Type volatile * device = Cy_SMIF_GetDeviceBySlot(base, slave);
    uint32_t temp;
    temp = SMIF_DEVICE_CTL(device);
    temp &= ~(SMIF_DEVICE_CTL_MERGE_TIMEOUT_Msk);
    SMIF_DEVICE_CTL(device) = temp | _VAL2FLD(SMIF_DEVICE_CTL_MERGE_EN,  1U)  |
                          _VAL2FLD(SMIF_DEVICE_CTL_MERGE_TIMEOUT,  (uint32_t)timeout);
}

