zhanzr/cy8ckit-demo/app/mtb_shared/mtb-pdl-cat1/release-v3.23.0/drivers/source/cy_smif.c
/*******************************************************************************
* Function Name: Cy_SMIF_HibernateCallback
****************************************************************************//**
*
* This function handles the transition of the SMIF into Hibernate mode.
* It prevents the device from entering Hibernate if the SMIF
* is actively communicating, or there is any data in the TX or RX FIFO, or SMIF
* is in memory mode.
*
* This function should be called during execution of \ref Cy_SysPm_SystemEnterHibernate
* therefore it must be registered as a callback before the call. To register it
* call \ref Cy_SysPm_RegisterCallback and specify \ref CY_SYSPM_HIBERNATE
* as the callback type.
*
* \note
* This API is template and user should add code for external memory enter/exit
* low power mode.
*
* \param callbackParams
* The pointer to the structure with SMIF SysPm callback parameters (pointer to
* SMIF registers, context and call mode \ref cy_stc_syspm_callback_params_t).
*
* \param mode
* Callback mode, see \ref cy_en_syspm_callback_mode_t
*
* \return
* \ref cy_en_syspm_status_t
*
* Example setup of SysPM deep sleep and hibernate mode
* \snippet smif/snippet/main.c SMIF SysPM Callback
*
*******************************************************************************/
cy_en_syspm_status_t Cy_SMIF_HibernateCallback(cy_stc_syspm_callback_params_t *callbackParams, cy_en_syspm_callback_mode_t mode)
{
    cy_en_syspm_status_t retStatus = CY_SYSPM_SUCCESS;

    CY_ASSERT_L1(NULL != callbackParams);

    SMIF_Type *locBase = (SMIF_Type *) callbackParams->base;
    cy_stc_smif_context_t *locContext = (cy_stc_smif_context_t *) callbackParams->context;

    switch(mode)
    {
        case CY_SYSPM_CHECK_READY:
        {
            /* Check if API is not busy executing transfer operation
            * If SPI bus is not busy, all data elements are transferred on
            * the bus from the TX FIFO and shifter and the RX FIFIOs is
            * empty - the SPI is ready enter Deep Sleep.
            */
            bool checkFail = (CY_SMIF_RX_BUSY == (cy_en_smif_txfr_status_t)
                                Cy_SMIF_GetTransferStatus(locBase, locContext));
            checkFail = (Cy_SMIF_BusyCheck(locBase)) || checkFail;
            checkFail = (Cy_SMIF_GetMode(locBase) == CY_SMIF_MEMORY) || checkFail;

            if (checkFail)
            {
                retStatus = CY_SYSPM_FAIL;

            }
            else
            {
                retStatus = CY_SYSPM_SUCCESS;
#if (CY_IP_MXSMIF_VERSION == 5u) || (CY_IP_MXSMIF_VERSION == 4u)
                if ((SMIF_CORE_Type *)locBase == (SMIF_CORE_Type *)SMIF0_CORE0)
                {
                    (void)Cy_SysClk_ClkHfDisable(CY_SMIF_CORE_0_HF);
                }
                if ((SMIF_CORE_Type *)locBase == (SMIF_CORE_Type *)SMIF0_CORE1)
                {
                    (void)Cy_SysClk_ClkHfDisable(CY_SMIF_CORE_1_HF);
                }
#endif
                Cy_SMIF_Disable(locBase);
            }
            /* Add check memory that memory not in progress */
        }
        break;

        case CY_SYSPM_CHECK_FAIL:
        {
            /* Other driver is not ready for Deep Sleep. Restore Active mode
            * configuration.
            */
#if (CY_IP_MXSMIF_VERSION == 5u) || (CY_IP_MXSMIF_VERSION == 4u)
            if ((SMIF_CORE_Type *)locBase == (SMIF_CORE_Type *)SMIF0_CORE0)
            {
                (void)Cy_SysClk_ClkHfEnable(CY_SMIF_CORE_0_HF);
            }
            if ((SMIF_CORE_Type *)locBase == (SMIF_CORE_Type *)SMIF0_CORE1)
            {
                (void)Cy_SysClk_ClkHfEnable(CY_SMIF_CORE_1_HF);
            }
#endif
            Cy_SMIF_Enable(locBase, locContext);

        }
        break;

        case CY_SYSPM_BEFORE_TRANSITION:
        {
            /* Put external memory in low power mode */
        }
        break;

        case CY_SYSPM_AFTER_TRANSITION:
        {
#if (CY_IP_MXSMIF_VERSION == 5u) || (CY_IP_MXSMIF_VERSION == 4u)
            if ((SMIF_CORE_Type *)locBase == (SMIF_CORE_Type *)SMIF0_CORE0)
            {
                (void)Cy_SysClk_ClkHfEnable(CY_SMIF_CORE_0_HF);
            }
            if ((SMIF_CORE_Type *)locBase == (SMIF_CORE_Type *)SMIF0_CORE1)
            {
                (void)Cy_SysClk_ClkHfEnable(CY_SMIF_CORE_1_HF);
            }
#endif

            Cy_SMIF_Enable(locBase, locContext);
            /* Put external memory in active mode */

        }
        break;

        default:
            retStatus = CY_SYSPM_FAIL;
        break;
    }

    return (retStatus);
}


#if (CY_IP_MXSMIF_VERSION == 2U) || (CY_IP_MXSMIF_VERSION >= 4U) || defined (CY_DOXYGEN)
/*******************************************************************************
* Function Name: Cy_SMIF_Set_DelayTapSel
****************************************************************************//**
*
* This function sets delay tap number for the SMIF master clock which is common
* for all memory devices connected.
*
* \param base
* Holds the base address of the SMIF block or SMIF_DEVICE block registers.
*
* \param tapSel
* delay tap selection to be set
*
* \return status (see \ref cy_en_smif_status_t).
*
* \note This API is supported on CAT1C and CAT1D devices.
*
* \snippet smif/snippet/main.c snippet_Cy_SMIF_Set_DelayTapSel
*******************************************************************************/
cy_en_smif_status_t Cy_SMIF_Set_DelayTapSel(SMIF_Type *base, uint8_t tapSel)
{
    if(tapSel > (SMIF_DELAY_TAPS_NR - 1U))
    {
      return CY_SMIF_BAD_PARAM;
    }

#if (CY_IP_MXSMIF_VERSION == 2U)
    SMIF_DELAY_TAP_SEL(base) = tapSel;
#else
    SMIF_CTL2(base) &= ~SMIF_CORE_CTL2_MDL_TAP_SEL_Msk;
    SMIF_CTL2(base) |= _VAL2FLD(SMIF_CORE_CTL2_MDL_TAP_SEL, tapSel);
#endif

    return CY_SMIF_SUCCESS;
}

/*******************************************************************************
* Function Name: Cy_SMIF_Get_DelayTapSel
****************************************************************************//**
*
* This function returns delay tap number which has been set for the SMIF.
*
* \param base
* Holds the base address of the SMIF block or SMIF_DEVICE block registers.
*
* \return read tap selection
*
* \note This API is supported on CAT1C and CAT1D devices.
*
* \snippet smif/snippet/main.c snippet_Cy_SMIF_Set_DelayTapSel
*******************************************************************************/
uint8_t Cy_SMIF_Get_DelayTapSel(SMIF_Type *base)
{
#if (CY_IP_MXSMIF_VERSION == 2U)
    return (uint8_t)(SMIF_DELAY_TAP_SEL(base));
#else
    return (uint8_t)(_FLD2VAL(SMIF_CORE_CTL2_MDL_TAP_SEL, SMIF_CTL2(base)));
#endif
}
#endif /*(CY_IP_MXSMIF_VERSION==2) || (CY_IP_MXSMIF_VERSION >= 5U)*/

#if (CY_IP_MXSMIF_VERSION >= 6U) || defined (CY_DOXYGEN)
/*******************************************************************************
* Function Name: Cy_SMIF_InitCache
****************************************************************************//**
*
* This function initializes SMIF internal CACHE with user provided configuration \ref cy_stc_smif_cache_config_t.
*
* \param base
* Holds the base address of the SMIF block.
*
* \param cache_config
* Contains the configuration information to configure SMIF internal Cache.
*
* \return Returns result of CACHE configuration.
*
* \note This API is supported on CAT1D devices.
*
* \snippet smif/snippet/main.c snippet_Cy_SMIF_InitCache
*******************************************************************************/
cy_en_smif_status_t Cy_SMIF_InitCache(SMIF_CACHE_BLOCK_Type *base, const cy_stc_smif_cache_config_t *cache_config)
{

    if ((base == NULL) || (cache_config == NULL))
    {
        return CY_SMIF_BAD_PARAM;
    }

#if defined (COMPONENT_SECURE_DEVICE)
    cy_en_smif_status_t result = CY_SMIF_SUCCESS;

    if ((cache_config->cache_region != NULL) && (cache_config->cache_region_count > 0U))
    {
        volatile uint32_t *region_base_address = &(base->MMIO.REGION0_BASE);

        for(uint32_t i = 0U; ((i < cache_config->cache_region_count) && (result == CY_SMIF_SUCCESS)); i++)
        {
            if ((cache_config->cache_region[i] != NULL) && (cache_config->cache_region[i]->enabled))
            {
                if ((cache_config->cache_region[i]->start_address % 4096U == 0U) && (cache_config->cache_region[i]->end_address % 4096U == 0U))
                {
                    *(region_base_address++) = cache_config->cache_region[i]->start_address;
                    *(region_base_address++) = (uint32_t)(_VAL2FLD(SMIF_CACHE_BLOCK_MMIO_REGION0_LIMIT_ENABLE, 1U) |
                                                          _VAL2FLD(SMIF_CACHE_BLOCK_MMIO_REGION0_LIMIT_ATTR, (uint32_t)cache_config->cache_region[i]->cache_attributes) |
                                                          cache_config->cache_region[i]->end_address);
                }
                else
                {
                    result = CY_SMIF_BAD_PARAM;
                }
            }
        }
    }
    if (result != CY_SMIF_BAD_PARAM)
    {
         base->CTRL =  (uint32_t)(_VAL2FLD(SMIF_CACHE_BLOCK_CTRL_ENABLE, cache_config->enabled) |
                             _VAL2FLD(SMIF_CACHE_BLOCK_CTRL_ALLOW_NSEC_ENABLE_READ, 1U) |
                             _VAL2FLD(SMIF_CACHE_BLOCK_CTRL_ALLOW_NSEC_MAINT_LINES, 1U) |
                             _VAL2FLD(SMIF_CACHE_BLOCK_CTRL_ALLOW_NSEC_NSECSTAT, 1U));

        base->MMIO.MMIO_CACHE_RET_EN = (uint32_t)cache_config->cache_retention_on;
    }
    return result;
#elif (defined(CY_USE_RPC_CALL) && (CY_USE_RPC_CALL == 1))
    cy_rpc_service_args_t rpcInputArgs, rpcOutputArgs;
    cy_en_smif_status_t status = CY_SMIF_BAD_PARAM;

    rpcInputArgs.argc = 3;
    rpcInputArgs.argv[0] = (uint32_t)CY_SECURE_SERVICE_TYPE_SMIF;
    rpcInputArgs.argv[1] = (uint32_t)CY_SECURE_SERVICE_SMIF_CACHE_CONFIGURE;
    rpcInputArgs.argv[2] = (uint32_t)base;

    cy_rpc_invec_t in_vec[] = {
        { .base = &rpcInputArgs, .len = sizeof(rpcInputArgs) },
        { .base = (void *)cache_config, .len = sizeof(*cache_config) },
    };

