zhanzr/cy8ckit-demo/app/mtb_shared/mtb-pdl-cat1/release-v3.23.0/drivers/source/cy_smif.c
    cy_rpc_outvec_t out_vec[] = {
        { .base = &rpcOutputArgs, .len = sizeof(rpcOutputArgs) },
    };
    rpcOutputArgs.argc = 0; /* updated in secure side */
    Cy_SecureServices_RPC(in_vec, CY_RPC_IOVEC_LEN(in_vec), out_vec, CY_RPC_IOVEC_LEN(out_vec));
    if (rpcOutputArgs.argc == 1)
    {
      status = (cy_en_smif_status_t)rpcOutputArgs.argv[0];
    }
    return status;
#else
   return CY_SMIF_BAD_PARAM;
#endif
}
/*******************************************************************************
* Function Name: Cy_SMIF_Clean_All_Cache
****************************************************************************//**
*
* This function cleans complete SMIF internal CACHE. This is a blocking call and
* returns with the status of CACHE clean operation.
*
* \param base
* Holds the base address of the SMIF block.
*
* \return Returns result of CACHE clean operation.
*
* \note This API is supported on CAT1D devices.
*******************************************************************************/
cy_en_smif_status_t Cy_SMIF_Clean_All_Cache(SMIF_CACHE_BLOCK_Type *base)
{
    if (base == NULL)
    {
        return CY_SMIF_BAD_PARAM;
    }

#if defined (COMPONENT_SECURE_DEVICE)
    base->MAINT_CTRL_ALL =  (uint32_t)_VAL2FLD(SMIF_CACHE_BLOCK_MAINT_CTRL_ALL_TRIG_CLEAN_ALL, 1U);

    /* Wait for Maintenance flag to be CLEARED */
    while (((base->MAINT_STATUS) & SMIF_CACHE_BLOCK_MAINT_STATUS_ONGOING_MAINT_Msk) == SMIF_CACHE_BLOCK_MAINT_STATUS_ONGOING_MAINT_Msk) {}

    return CY_SMIF_SUCCESS;
#elif (defined(CY_USE_RPC_CALL) && (CY_USE_RPC_CALL == 1))
    cy_rpc_service_args_t rpcInputArgs, rpcOutputArgs;
    cy_en_smif_status_t status = CY_SMIF_BAD_PARAM;
    rpcInputArgs.argc = 3;
    rpcInputArgs.argv[0] = (uint32_t)CY_SECURE_SERVICE_TYPE_SMIF;
    rpcInputArgs.argv[1] = (uint32_t)CY_SECURE_SERVICE_SMIF_CACHE_CLEAN_ALL;
    rpcInputArgs.argv[2] = (uint32_t)base;

    cy_rpc_invec_t in_vec[] = {
        { .base = &rpcInputArgs, .len = sizeof(rpcInputArgs) },
    };

    cy_rpc_outvec_t out_vec[] = {
        { .base = &rpcOutputArgs, .len = sizeof(rpcOutputArgs) },
    };
    rpcOutputArgs.argc = 0; /* updated in secure side */
    Cy_SecureServices_RPC(in_vec, CY_RPC_IOVEC_LEN(in_vec), out_vec, CY_RPC_IOVEC_LEN(out_vec));
    if (rpcOutputArgs.argc == 1)
    {
      status = (cy_en_smif_status_t)rpcOutputArgs.argv[0];
    }
    return status;
#else
   return CY_SMIF_BAD_PARAM;
#endif
}
/*******************************************************************************
* Function Name: Cy_SMIF_Invalidate_All_Cache
****************************************************************************//**
* This function invalidates complete SMIF internal CACHE. This is a blocking call and
* returns with the status of CACHE invalidate operation.
*
* \param base
* Holds the base address of the SMIF block.
*
* \return Returns result of CACHE invalidate operation.
*
* \note This API is supported on CAT1D devices.
*******************************************************************************/
cy_en_smif_status_t Cy_SMIF_Invalidate_All_Cache(SMIF_CACHE_BLOCK_Type *base)
{
    if (base == NULL)
    {
        return CY_SMIF_BAD_PARAM;
    }

#if defined (COMPONENT_SECURE_DEVICE)
    base->MAINT_CTRL_ALL =  (uint32_t)_VAL2FLD(SMIF_CACHE_BLOCK_MAINT_CTRL_ALL_TRIG_INVALIDATE_ALL, 1U);

    /* Wait for Maintenance flag to be CLEARED */
    while (((base->MAINT_STATUS) & SMIF_CACHE_BLOCK_MAINT_STATUS_ONGOING_MAINT_Msk) == SMIF_CACHE_BLOCK_MAINT_STATUS_ONGOING_MAINT_Msk) {}

    return CY_SMIF_SUCCESS;
#elif (defined(CY_USE_RPC_CALL) && (CY_USE_RPC_CALL == 1))
    cy_rpc_service_args_t rpcInputArgs, rpcOutputArgs;
    cy_en_smif_status_t status = CY_SMIF_BAD_PARAM;
    rpcInputArgs.argc = 3;
    rpcInputArgs.argv[0] = (uint32_t)CY_SECURE_SERVICE_TYPE_SMIF;
    rpcInputArgs.argv[1] = (uint32_t)CY_SECURE_SERVICE_SMIF_CACHE_INVALIDATE_ALL;
    rpcInputArgs.argv[2] = (uint32_t)base;

    cy_rpc_invec_t in_vec[] = {
        { .base = &rpcInputArgs, .len = sizeof(rpcInputArgs) },
    };

    cy_rpc_outvec_t out_vec[] = {
        { .base = &rpcOutputArgs, .len = sizeof(rpcOutputArgs) },
    };
    rpcOutputArgs.argc = 0; /* updated in secure side */
    Cy_SecureServices_RPC(in_vec, CY_RPC_IOVEC_LEN(in_vec), out_vec, CY_RPC_IOVEC_LEN(out_vec));
    if (rpcOutputArgs.argc == 1)
    {
      status = (cy_en_smif_status_t)rpcOutputArgs.argv[0];
    }
    return status;
#else
   return CY_SMIF_BAD_PARAM;
#endif
}
/*******************************************************************************
* Function Name: Cy_SMIF_Clean_And_Invalidate_All_Cache
****************************************************************************//**
*
* This function cleans and invalidates complete SMIF internal CACHE. This is a blocking call and
* returns with the status of CACHE invalidate and clean operation.
*
* \param base
* Holds the base address of the SMIF block.
*
* \return Returns result of CACHE clean and invalidate operation.
*
* \note This API is supported on CAT1D devices.
*******************************************************************************/
cy_en_smif_status_t Cy_SMIF_Clean_And_Invalidate_All_Cache(SMIF_CACHE_BLOCK_Type *base)
{
    if (base == NULL)
    {
        return CY_SMIF_BAD_PARAM;
    }

#if defined (COMPONENT_SECURE_DEVICE)
    base->MAINT_CTRL_ALL =  (uint32_t)(_VAL2FLD(SMIF_CACHE_BLOCK_MAINT_CTRL_ALL_TRIG_INVALIDATE_ALL, 1U) |
                                        _VAL2FLD(SMIF_CACHE_BLOCK_MAINT_CTRL_ALL_TRIG_CLEAN_ALL, 1U));

    /* Wait for Maintenance flag to be CLEARED */
    while (((base->MAINT_STATUS) & SMIF_CACHE_BLOCK_MAINT_STATUS_ONGOING_MAINT_Msk) == SMIF_CACHE_BLOCK_MAINT_STATUS_ONGOING_MAINT_Msk) {}

    return CY_SMIF_SUCCESS;
#elif (defined(CY_USE_RPC_CALL) && (CY_USE_RPC_CALL == 1))
    cy_rpc_service_args_t rpcInputArgs, rpcOutputArgs;
    cy_en_smif_status_t status = CY_SMIF_BAD_PARAM;
    rpcInputArgs.argc = 3;
    rpcInputArgs.argv[0] = (uint32_t)CY_SECURE_SERVICE_TYPE_SMIF;
    rpcInputArgs.argv[1] = (uint32_t)CY_SECURE_SERVICE_SMIF_CACHE_INVALIDATE_AND_CLEAN_ALL;
    rpcInputArgs.argv[2] = (uint32_t)base;

    cy_rpc_invec_t in_vec[] = {
        { .base = &rpcInputArgs, .len = sizeof(rpcInputArgs) },
    };

