zhanzr/cy8ckit-demo/app/mtb_shared/mtb-pdl-cat1/release-v3.23.0/drivers/source/cy_smif.c
    cy_rpc_outvec_t out_vec[] = {
        { .base = &rpcOutputArgs, .len = sizeof(rpcOutputArgs) },
    };
    rpcOutputArgs.argc = 0; /* updated in secure side */
    Cy_SecureServices_RPC(in_vec, CY_RPC_IOVEC_LEN(in_vec), out_vec, CY_RPC_IOVEC_LEN(out_vec));
    if (rpcOutputArgs.argc == 1)
    {
      status = (cy_en_smif_status_t)rpcOutputArgs.argv[0];
    }
    return status;
#else
   return CY_SMIF_BAD_PARAM;
#endif
}

/*******************************************************************************
* Function Name: Cy_SMIF_Clean_Cache_by_Addr
****************************************************************************//**
*
* This function cleans cache using the address and size specified by user.
* This is a blocking call and returns with the status of CACHE clean operation.
* Size must be specified in multiples of CACHE line size (32 bytes).
*
* \param base
* Holds the base address of the SMIF block.
*
* \param is_secure_view
* Specifies the view on which cache operation has to be performed. In non-secure world
* this parameter is ignored and defaulted to non-secure view cache operation.
*
* \param address
* start address from which cache operation should be performed.
*
* \param size
* size in multiples of CACHE line size \ref CY_SMIF_CACHE_LINE_SIZE_IN_BYTES.
*
* \return Returns result of CACHE clean operation.
*
* \note This API is supported on CAT1D devices.
*******************************************************************************/
cy_en_smif_status_t Cy_SMIF_Clean_Cache_by_Addr(SMIF_CACHE_BLOCK_Type *base, bool is_secure_view, uint32_t address, uint32_t size)
{

    if ( (base == NULL) || ((address % CY_SMIF_CACHE_LINE_SIZE_IN_BYTES) != 0U) || ((size % CY_SMIF_CACHE_LINE_SIZE_IN_BYTES) != 0U))
    {
        return CY_SMIF_BAD_PARAM;
    }

#if defined (COMPONENT_SECURE_DEVICE)
    while (size != 0U)
    {
         base->MAINT_CTRL_LINES =  (uint32_t)(_VAL2FLD(SMIF_CACHE_BLOCK_MAINT_CTRL_LINES_TRIG_CLEAN, 1U) |
                                        _VAL2FLD(SMIF_CACHE_BLOCK_MAINT_CTRL_LINES_SECURITY, (uint8_t)is_secure_view) |
                                        _VAL2FLD(SMIF_CACHE_BLOCK_MAINT_CTRL_LINES_SECURITY, (uint8_t)address));
        address += CY_SMIF_CACHE_LINE_SIZE_IN_BYTES;
        size -= CY_SMIF_CACHE_LINE_SIZE_IN_BYTES;
    }

    return CY_SMIF_SUCCESS;
#elif (defined(CY_USE_RPC_CALL) && (CY_USE_RPC_CALL == 1))
    cy_rpc_service_args_t rpcInputArgs, rpcOutputArgs;
    cy_en_smif_status_t status = CY_SMIF_BAD_PARAM;
    rpcInputArgs.argc = 4;
    rpcInputArgs.argv[0] = (uint32_t)CY_SECURE_SERVICE_TYPE_SMIF;
    rpcInputArgs.argv[1] = (uint32_t)CY_SECURE_SERVICE_SMIF_CACHE_CLEAN_BY_ADDR;
    rpcInputArgs.argv[2] = (uint32_t)base;
    rpcInputArgs.argv[3] = (uint32_t)is_secure_view;

    cy_rpc_invec_t in_vec[] = {
        { .base = &rpcInputArgs, .len = sizeof(rpcInputArgs) },
        { .base = (void *)address, .len = size },
    };
    cy_rpc_outvec_t out_vec[] = {
        { .base = &rpcOutputArgs, .len = sizeof(rpcOutputArgs) },
    };
    rpcOutputArgs.argc = 0; /* updated in secure side */
    Cy_SecureServices_RPC(in_vec, CY_RPC_IOVEC_LEN(in_vec), out_vec, CY_RPC_IOVEC_LEN(out_vec));
    if (rpcOutputArgs.argc == 1)
    {
      status = (cy_en_smif_status_t)rpcOutputArgs.argv[0];
    }
    return status;
#else
   (void)is_secure_view; (void)size;
   return CY_SMIF_BAD_PARAM;
#endif
}
/*******************************************************************************
* Function Name: Cy_SMIF_Invalidate_Cache_by_Addr
****************************************************************************//**
*
* This function invalidates cache using the address and size specified by user.
* This is a blocking call and returns with the status of CACHE invalidate operation.
* Size must be specified in multiples of CACHE line size (32 bytes).
*
* \param base
* Holds the base address of the SMIF block.
*
* \param is_secure_view
* Specifies the view on which cache operation has to be performed. In non-secure world
* this parameter is ignored and defaulted to non-secure view cache operation.
*
* \param address
* start address from which cache operation should be performed.
*
* \param size
* size in multiples of CACHE line size \ref CY_SMIF_CACHE_LINE_SIZE_IN_BYTES.
*
* \return Returns result of CACHE invalidate operation.
*
* \note This API is supported on CAT1D devices.
*******************************************************************************/
cy_en_smif_status_t Cy_SMIF_Invalidate_Cache_by_Addr(SMIF_CACHE_BLOCK_Type *base, bool is_secure_view, uint32_t address, uint32_t size)
{
    if ( (base == NULL) || ((address % CY_SMIF_CACHE_LINE_SIZE_IN_BYTES) != 0U) || ((size % CY_SMIF_CACHE_LINE_SIZE_IN_BYTES) != 0U))
    {
        return CY_SMIF_BAD_PARAM;
    }
#if defined (COMPONENT_SECURE_DEVICE)
    while (size != 0U)
    {
         base->MAINT_CTRL_LINES =  (uint32_t)(_VAL2FLD(SMIF_CACHE_BLOCK_MAINT_CTRL_LINES_TRIG_INVALIDATE, 1U) |
                                        _VAL2FLD(SMIF_CACHE_BLOCK_MAINT_CTRL_LINES_SECURITY, (uint8_t)is_secure_view) |
                                        _VAL2FLD(SMIF_CACHE_BLOCK_MAINT_CTRL_LINES_SECURITY, (uint8_t)address));
        address += CY_SMIF_CACHE_LINE_SIZE_IN_BYTES;
        size -= CY_SMIF_CACHE_LINE_SIZE_IN_BYTES;
    }

    return CY_SMIF_SUCCESS;
#elif (defined(CY_USE_RPC_CALL) && (CY_USE_RPC_CALL == 1))
    cy_rpc_service_args_t rpcInputArgs, rpcOutputArgs;
    cy_en_smif_status_t status = CY_SMIF_BAD_PARAM;
    rpcInputArgs.argc = 4;
    rpcInputArgs.argv[0] = (uint32_t)CY_SECURE_SERVICE_TYPE_SMIF;
    rpcInputArgs.argv[1] = (uint32_t)CY_SECURE_SERVICE_SMIF_CACHE_INVALIDATE_BY_ADDR;
    rpcInputArgs.argv[2] = (uint32_t)base;
    rpcInputArgs.argv[3] = (uint32_t)is_secure_view;

    cy_rpc_invec_t in_vec[] = {
        { .base = &rpcInputArgs, .len = sizeof(rpcInputArgs) },
        { .base = (void *)address, .len = size },
    };

    cy_rpc_outvec_t out_vec[] = {
        { .base = &rpcOutputArgs, .len = sizeof(rpcOutputArgs) },
    };
    rpcOutputArgs.argc = 0; /* updated in secure side */
    Cy_SecureServices_RPC(in_vec, CY_RPC_IOVEC_LEN(in_vec), out_vec, CY_RPC_IOVEC_LEN(out_vec));
    if (rpcOutputArgs.argc == 1)
    {
      status = (cy_en_smif_status_t)rpcOutputArgs.argv[0];
    }
    return status;
#else
   (void)is_secure_view; (void)size;
   return CY_SMIF_BAD_PARAM;
#endif
}
/*******************************************************************************
* Function Name: Cy_SMIF_Clean_And_Invalidate_Cache_by_Addr
****************************************************************************//**
*
* This function cleans and invalidates cache using the address and size specified by user.
* This is a blocking call and returns with the status of CACHE operation.
* Size must be specified in multiples of CACHE line size (32 bytes).
*
* \param base
* Holds the base address of the SMIF block.
*
* \param is_secure_view
* Specifies the view on which cache operation has to be performed. In non-secure world
* this parameter is ignored and defaulted to non-secure view cache operation.
*
* \param address
* start address from which cache operation should be performed.
*
* \param size
* size in multiples of CACHE line size \ref CY_SMIF_CACHE_LINE_SIZE_IN_BYTES.
*
* \return Returns result of CACHE operation.
*
* \note This API is supported on CAT1D devices.
*******************************************************************************/
cy_en_smif_status_t Cy_SMIF_Clean_And_Invalidate_Cache_by_Addr(SMIF_CACHE_BLOCK_Type *base, bool is_secure_view, uint32_t address, uint32_t size)
{

    if ( (base == NULL) || ((address % CY_SMIF_CACHE_LINE_SIZE_IN_BYTES) != 0U) || ((size % CY_SMIF_CACHE_LINE_SIZE_IN_BYTES) != 0U))
    {
        return CY_SMIF_BAD_PARAM;
    }
#if defined (COMPONENT_SECURE_DEVICE)
    while (size != 0U)
    {
         base->MAINT_CTRL_LINES =  (uint32_t)(_VAL2FLD(SMIF_CACHE_BLOCK_MAINT_CTRL_LINES_TRIG_INVALIDATE, 1U) |
                                              _VAL2FLD(SMIF_CACHE_BLOCK_MAINT_CTRL_LINES_TRIG_CLEAN, 1U) |
                                              _VAL2FLD(SMIF_CACHE_BLOCK_MAINT_CTRL_LINES_SECURITY, (uint8_t)is_secure_view) |
                                              _VAL2FLD(SMIF_CACHE_BLOCK_MAINT_CTRL_LINES_SECURITY, (uint8_t)address));
        address += CY_SMIF_CACHE_LINE_SIZE_IN_BYTES;
        size -= CY_SMIF_CACHE_LINE_SIZE_IN_BYTES;
    }

    return CY_SMIF_SUCCESS;
#elif (defined(CY_USE_RPC_CALL) && (CY_USE_RPC_CALL == 1))
    cy_rpc_service_args_t rpcInputArgs, rpcOutputArgs;
    cy_en_smif_status_t status = CY_SMIF_BAD_PARAM;
    rpcInputArgs.argc = 4;
    rpcInputArgs.argv[0] = (uint32_t)CY_SECURE_SERVICE_TYPE_SMIF;
    rpcInputArgs.argv[1] = (uint32_t)CY_SECURE_SERVICE_SMIF_CACHE_INVALIDATE_AND_CLEAN_BY_ADDR;
    rpcInputArgs.argv[2] = (uint32_t)base;
    rpcInputArgs.argv[3] = (uint32_t)is_secure_view;

    cy_rpc_invec_t in_vec[] = {
        { .base = &rpcInputArgs, .len = sizeof(rpcInputArgs) },
        { .base = &address, .len = size },
    };

