zhanzr/cy8ckit-demo/app/mtb_shared/mtb-pdl-cat1/release-v3.23.0/drivers/source/cy_smif.c
    cy_rpc_outvec_t out_vec[] = {
        { .base = &rpcOutputArgs, .len = sizeof(rpcOutputArgs) },
    };
    rpcOutputArgs.argc = 0; /* updated in secure side */
    Cy_SecureServices_RPC(in_vec, CY_RPC_IOVEC_LEN(in_vec), out_vec, CY_RPC_IOVEC_LEN(out_vec));
    if (rpcOutputArgs.argc == 1)
    {
      status = (cy_en_smif_status_t)rpcOutputArgs.argv[0];
    }

    return status;
#else
   (void)is_secure_view; (void)size;
   return CY_SMIF_BAD_PARAM;
#endif
}
/*******************************************************************************
* Function Name: Cy_SMIF_IsCacheEnabled
****************************************************************************//**
*
* This function checks whether Cache is enabled or not
*
* \param base
* Holds the base address of the SMIF block.
*
* \param cache_status
* Holds the Cache status
*
* \return CY_SMIF_SUCCESS if we are able get the Cache status otherwise returns CY_SMIF_BAD_PARAM.
*
* \note This API is supported on CAT1D devices.
*******************************************************************************/
cy_en_smif_status_t Cy_SMIF_IsCacheEnabled(SMIF_CACHE_BLOCK_Type *base, bool *cache_status)
{
   CY_ASSERT_L1(NULL != base);
   CY_ASSERT_L1(NULL != cache_status);

#if defined (COMPONENT_SECURE_DEVICE)

   *cache_status = (bool)_FLD2VAL(SMIF_CACHE_BLOCK_CTRL_ENABLE, base->CTRL);
   return CY_SMIF_SUCCESS;

#elif (defined(CY_USE_RPC_CALL) && (CY_USE_RPC_CALL == 1))
    cy_rpc_service_args_t rpcInputArgs, rpcOutputArgs;
    cy_en_smif_status_t status = CY_SMIF_BAD_PARAM;
    rpcInputArgs.argc = 3;
    rpcInputArgs.argv[0] = (uint32_t)CY_SECURE_SERVICE_TYPE_SMIF;
    rpcInputArgs.argv[1] = (uint32_t)CY_SECURE_SERVICE_SMIF_CACHE_GET_STATUS;
    rpcInputArgs.argv[2] = (uint32_t)base;

    cy_rpc_invec_t in_vec[] = {
        { .base = &rpcInputArgs, .len = sizeof(rpcInputArgs) },
    };

    cy_rpc_outvec_t out_vec[] = {
        { .base = &rpcOutputArgs, .len = sizeof(rpcOutputArgs) },
        { .base = cache_status, .len = sizeof(*cache_status) },
    };

    rpcOutputArgs.argc = 0U; /* updated in secure side */
    Cy_SecureServices_RPC(in_vec, CY_RPC_IOVEC_LEN(in_vec), out_vec, CY_RPC_IOVEC_LEN(out_vec));

    if (rpcOutputArgs.argc == 1U)
    {
        status = (cy_en_smif_status_t)rpcOutputArgs.argv[0];
    }
    return status;

#else
   (void)base;
   (void)cache_status;
   return CY_SMIF_BAD_PARAM;
#endif
}

#endif

#endif /* defined (CY_IP_MXS40SRSS) || defined (CY_IP_MXS40SSRSS) || defined (CY_IP_MXS22SRSS) */

#if defined(__cplusplus)
}
#endif

#endif /* CY_IP_MXSMIF */

/* [] END OF FILE */
